```
terraform apply
aws_vpc.myVPC: Refreshing state... [id=vpc-0b84fee52f4b091b3]
aws_internet_gateway.myGW: Refreshing state... [id=igw-0c46b1986497a57b1]
aws_subnet.public-a: Refreshing state... [id=subnet-078d91c53d61167a7]
aws_security_group.admin: Refreshing state... [id=sg-0346e0eeb8d27223f]
aws_route_table.public-route: Refreshing state... [id=rtb-03c713656f240498e]
aws_route_table_association.puclic-a: Refreshing state... [id=rtbassoc-0eabad24dcc8114df]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.cm-test will be created
  + resource "aws_instance" "cm-test" {
      + ami                          = "ami-cbf90ecb"
      + arn                          = (known after apply)
      + associate_public_ip_address  = true
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t2.micro"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = (known after apply)
      + network_interface_id         = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = "subnet-078d91c53d61167a7"
      + tags                         = {
          + "Name" = "cm-test"
        }
      + tenancy                      = (known after apply)
      + volume_tags                  = (known after apply)
      + vpc_security_group_ids       = [
          + "sg-0346e0eeb8d27223f",
        ]

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_instance.cm-test: Creating...
aws_instance.cm-test: Still creating... [10s elapsed]
aws_instance.cm-test: Still creating... [20s elapsed]
aws_instance.cm-test: Creation complete after 23s [id=i-020215a4c871aeb29]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:

public_ip_of_cm-test = 3.112.41.118
```